'''Знаки препинания '''
# Двоеточие :
#
# Используется для обозначения начала блока кода
# (например, в условных операторах, циклах, функциях).
x = 6
y = 0
if x > y:
    print("x больше y")
# Отступы:
# Пробелы или табуляции используются для создания отступов
# и обозначения вложенности блоков кода.
# Отступы играют ключевую роль в структуре кода.

# Запятая ,:
# Используется для разделения элементов в кортежах, списках, аргументах функций и т.д.

# очка с запятой ;:
# В Python, обычно, точка с запятой не обязательна, так как конец строки считается концом инструкции.
# Однако её можно использовать для разделения нескольких инструкций в одной строке.

# Круглые скобки () используются для создания кортежей и передачи аргументов функциям,
# квадратные скобки [] применяются для формирования списков и доступа к их элементам по индексу,
# а фигурные скобки {} используются для создания словарей и множеств, а также для обозначения блоков
# кода в циклах,условных операторах и функциях в языке программирования Python.
