"""'Операции над числами"""
x=5
y=0
# Арифметические операции:
# Сложение (+):
result = x + y
# Вычитание (-):
result = x - y
# Умножение (*):
result = x * y
# Деление (/):
result = x / y
# Возведение в степень (**):
result = x ** 2  # x в квадрате

# Операции сравнения:
# Равно (==):
is_equal = x == y
# Не равно (!=):
is_not_equal = x != y
# Меньше (<):
is_smaller = x < y
# Больше (>):
is_greater = x > y
# Меньше или равно (<=):
is_smaller_or_equal = x <= y
# Больше или равно (>=):
is_greater_or_equal = x >= y

# Логические операции:
# Логическое И (and):
result = (x > 0) and (y < 10)
# Логическое ИЛИ (or):
result = (x > 0) or (y < 10)
# Логическое НЕ (not):
result = not (x > 0)